Revit 2027 API
RebarShapeDefinitionByArc.SetConstraints Method
 Assign a new list of constraints to this definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetConstraints(
	IList<RebarShapeConstraint> constraints
)
Public Sub SetConstraints (
	constraints As IList(Of RebarShapeConstraint)
)
public:
void SetConstraints(
	IList<RebarShapeConstraint^>^ constraints
)
member SetConstraints :
        constraints : IList<RebarShapeConstraint> -> unit
Parameters
constraints IList<RebarShapeConstraint>
 A new list of constraints.
Exceptions
Exception | Condition
ArgumentException |  One or more of the constraints is of a type not supported for this definition. -or- One or more of the constraints refers to a parameter that has not been added yet.
ArgumentNullException |  A non-optional argument was null
Remarks
 Any existing constraints are discarded. The new constraints replace them. Any parameters driving the constraints must already be added with AddParameter().
 If the Type is Arc or LappedCircle, the allowable constraint types are:
RebarShapeConstraintArcLength
RebarShapeConstraintRadius
RebarShapeConstraintDiameter
RebarShapeConstraintCircumference
RebarShapeConstraintSagittaLength
RebarShapeConstraintChordLength
 At least two independent constraints must be specified. Overconstraining is supported.
 If the Type is Spiral, the allowable constraints are:
RebarShapeConstraintRadius
RebarShapeConstraintDiameter
RebarShapeConstraintCircumference
 At least one constraint must be specified.
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace